app/controllers/products_controller.rb

  def create
    @product = Product.create(product_params)
---
INSERT INTO "products" ("name", "price", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?, ?)  [["name", "New Product"], ["price", 2], ["created_at", "2019-05-24 19:59:08.322478"], ["updated_at", "2019-05-24 19:59:08.322478"], ["description", "This is a very nice product!"]]